Revit 2027 API
BuiltInFailures.JoinElementsFailures.JoiningDisjoint Property
 Highlighted elements are joined but do not intersect.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId JoiningDisjoint { get; }
Public Shared ReadOnly Property JoiningDisjoint As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ JoiningDisjoint {
	FailureDefinitionId^ get ();
}
static member JoiningDisjoint : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace